#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
yandex_organizationmanager_os_login_settings.os_login_settings: Refreshing state... [id=bpf87tprvvpe4i8ub7a0]
yandex_organizationmanager_group.ai-radio-dev: Refreshing state... [id=ajes3fclggt6m8jde0hq]
yandex_resourcemanager_cloud.ai-radio: Refreshing state... [id=b1g8qcamg52qan7dcgi5]
yandex_organizationmanager_group.ai-radio-ops: Refreshing state... [id=ajeqblbmiknk44l6stsu]
yandex_billing_cloud_binding.ai-radio-prod-billing: Refreshing state... [id=dn2d49h1arjv675doqph/cloud/b1g8qcamg52qan7dcgi5]
yandex_organizationmanager_group_membership.ai-radio-ops-membership: Refreshing state... [id=group-membership/ajeqblbmiknk44l6stsu]
yandex_organizationmanager_organization_iam_member.ai-radio-ops-viewer: Refreshing state... [id=bpf87tprvvpe4i8ub7a0/viewer/group:ajeqblbmiknk44l6stsu]
yandex_organizationmanager_group_membership.ai-radio-dev-membership: Refreshing state... [id=group-membership/ajes3fclggt6m8jde0hq]
yandex_organizationmanager_organization_iam_member.ai-radio-dev-logging-reader: Refreshing state... [id=bpf87tprvvpe4i8ub7a0/logging.reader/group:ajes3fclggt6m8jde0hq]
yandex_organizationmanager_organization_iam_member.ai-radio-dev-monitoring-viewer: Refreshing state... [id=bpf87tprvvpe4i8ub7a0/monitoring.viewer/group:ajes3fclggt6m8jde0hq]
yandex_organizationmanager_organization_iam_member.ai-radio-dev-auditor: Refreshing state... [id=bpf87tprvvpe4i8ub7a0/auditor/group:ajes3fclggt6m8jde0hq]
yandex_organizationmanager_organization_iam_member.ai-radio-ops-monitoring-editor: Refreshing state... [id=bpf87tprvvpe4i8ub7a0/monitoring.editor/group:ajeqblbmiknk44l6stsu]
yandex_resourcemanager_folder.network: Refreshing state... [id=b1gm0bq3bsnis4oelr25]
yandex_resourcemanager_folder.logs: Refreshing state... [id=b1giva7npaibs6fea9s8]
yandex_resourcemanager_folder.storage: Refreshing state... [id=b1ga4mk6ef2hkmpaibvd]
yandex_resourcemanager_folder.secrets: Refreshing state... [id=b1gv2q3vcuevpbncteer]
yandex_resourcemanager_folder.sa: Refreshing state... [id=b1gp0hm2r5phfig97crb]
yandex_resourcemanager_folder.registry: Refreshing state... [id=b1gpdecdb6t6km1ukb60]
yandex_container_registry.ai-radio-registry: Refreshing state... [id=crp8rkrr8btel4schut6]
yandex_dns_zone.ai-radio-zone: Refreshing state... [id=dnsa3b4e1v1m1t0bts9n]
yandex_vpc_address.ai-radio-stream-ip: Refreshing state... [id=fl8edt7iim95kt7qusj6]
yandex_vpc_gateway.egress-gateway: Refreshing state... [id=enpkq1ms5ckpdku7jcel]
yandex_cm_certificate.ai-radio-cert: Refreshing state... [id=fpql2nfpt7g9kugod3tp]
yandex_cm_certificate.stream-ai-radio-cert: Refreshing state... [id=fpqkt3jp8mdp76t4la45]
yandex_vpc_network.default-network: Refreshing state... [id=enpqdmt58605ua93ds4n]
yandex_lockbox_secret.aws: Refreshing state... [id=e6qrrgaj6il08d3bufg3]
yandex_lockbox_secret.tts: Refreshing state... [id=e6qgui96khie6kv6cqrb]
yandex_lockbox_secret.docker: Refreshing state... [id=e6qlvcdhgtlestj1rd6e]
yandex_iam_service_account.tts-sa: Refreshing state... [id=aje21tsb3rsublejccrb]
yandex_iam_service_account.ai-radio-container-registry-sa: Refreshing state... [id=ajeo2ks4ipffhhuf3nmp]
yandex_iam_service_account.alb-sa: Refreshing state... [id=ajedncv4lhmfb2ic55h9]
yandex_lockbox_secret.alb: Refreshing state... [id=e6qkcanbsrsvujgq5oi5]
yandex_iam_service_account.aws-sa: Refreshing state... [id=ajesfa6k548ik69rtcf7]
yandex_iam_service_account.k8s-sa: Refreshing state... [id=aje76ri01fl3cjekutnu]
yandex_logging_group.k8s-alb-log: Refreshing state... [id=e2328eb1mrb5bsl0995r]
yandex_logging_group.static-gateway-log: Refreshing state... [id=e23v4d8uohnhp5gkrlij]
yandex_logging_group.k8s-master-log: Refreshing state... [id=e232m412emt6na129bsc]
yandex_lockbox_secret_iam_binding.docker-viewer: Refreshing state... [id=e6qlvcdhgtlestj1rd6e/viewer]
yandex_lockbox_secret_iam_binding.tts-viewer: Refreshing state... [id=e6qgui96khie6kv6cqrb/viewer]
yandex_lockbox_secret_iam_binding.aws-viewer: Refreshing state... [id=e6qrrgaj6il08d3bufg3/viewer]
yandex_resourcemanager_cloud_iam_member.tts-sa-tts-user: Refreshing state... [id=b1g8qcamg52qan7dcgi5/ai.speechkit-tts.user/serviceAccount:aje21tsb3rsublejccrb]
yandex_iam_service_account_api_key.tts-sa-api-key: Refreshing state... [id=aje99i2kjdq6rio7d6fr]
yandex_resourcemanager_folder_iam_member.ai-radio-crsa-images-pusher: Refreshing state... [id=b1gpdecdb6t6km1ukb60/container-registry.images.pusher/serviceAccount:ajeo2ks4ipffhhuf3nmp]
yandex_resourcemanager_folder_iam_member.ai-radio-crsa-images-create: Refreshing state... [id=b1gpdecdb6t6km1ukb60/container-registry.editor/serviceAccount:ajeo2ks4ipffhhuf3nmp]
yandex_resourcemanager_folder_iam_member.ai-radio-crsa-images-puller: Refreshing state... [id=b1gpdecdb6t6km1ukb60/container-registry.images.puller/serviceAccount:ajeo2ks4ipffhhuf3nmp]
yandex_iam_service_account_key.ai-radio-crsa-key: Refreshing state... [id=ajeuldn0tgb7ps1gimu1]
yandex_vpc_default_security_group.default-sg: Refreshing state... [id=enpvq2lms64cp7ro1cta]
yandex_vpc_route_table.route-table: Refreshing state... [id=enpe0uhrth0bvsf7tu6g]
data.yandex_cm_certificate_content.ai-radio-cert-content: Reading...
yandex_lockbox_secret_iam_binding.alb-viewer: Refreshing state... [id=e6qkcanbsrsvujgq5oi5/viewer]
yandex_vpc_security_group.k8s-sg: Refreshing state... [id=enpb8hj4pkkkhrc8fo8b]
yandex_resourcemanager_folder_iam_member.alb-sa-alb-editor: Refreshing state... [id=b1gm0bq3bsnis4oelr25/alb.editor/serviceAccount:ajedncv4lhmfb2ic55h9]
yandex_resourcemanager_folder_iam_member.alb-sa-cert-downloader: Refreshing state... [id=b1gm0bq3bsnis4oelr25/certificate-manager.certificates.downloader/serviceAccount:ajedncv4lhmfb2ic55h9]
yandex_resourcemanager_folder_iam_member.alb-sa-private-admin: Refreshing state... [id=b1gm0bq3bsnis4oelr25/vpc.privateAdmin/serviceAccount:ajedncv4lhmfb2ic55h9]
yandex_iam_service_account_key.alb-sa-key: Refreshing state... [id=aje7jdjr4o3nmoci8nh7]
yandex_resourcemanager_folder_iam_member.alb-sa-compute-viewer: Refreshing state... [id=b1gm0bq3bsnis4oelr25/compute.viewer/serviceAccount:ajedncv4lhmfb2ic55h9]
yandex_resourcemanager_folder_iam_member.alb-sa-public-admin: Refreshing state... [id=b1gm0bq3bsnis4oelr25/vpc.publicAdmin/serviceAccount:ajedncv4lhmfb2ic55h9]
yandex_resourcemanager_folder_iam_member.aws-sa-ymq-writer: Refreshing state... [id=b1gp0hm2r5phfig97crb/ymq.writer/serviceAccount:ajesfa6k548ik69rtcf7]
yandex_resourcemanager_folder_iam_member.aws-sa-os-editor: Refreshing state... [id=b1ga4mk6ef2hkmpaibvd/storage.editor/serviceAccount:ajesfa6k548ik69rtcf7]
yandex_iam_service_account_static_access_key.aws-sa-static-key: Refreshing state... [id=ajeielsj842jqnf09aue]
yandex_resourcemanager_folder_iam_member.aws-sa-ymq-reader: Refreshing state... [id=b1gp0hm2r5phfig97crb/ymq.reader/serviceAccount:ajesfa6k548ik69rtcf7]
yandex_resourcemanager_folder_iam_member.k8s-sa-logging-writer: Refreshing state... [id=b1giva7npaibs6fea9s8/logging.writer/serviceAccount:aje76ri01fl3cjekutnu]
yandex_resourcemanager_folder_iam_member.k8s-sa-public-admin: Refreshing state... [id=b1gm0bq3bsnis4oelr25/vpc.publicAdmin/serviceAccount:aje76ri01fl3cjekutnu]
yandex_resourcemanager_folder_iam_member.k8s-sa-cluster-agent: Refreshing state... [id=b1gm0bq3bsnis4oelr25/k8s.clusters.agent/serviceAccount:aje76ri01fl3cjekutnu]
yandex_resourcemanager_folder_iam_member.k8s-sa-load-balancer-admin: Refreshing state... [id=b1gm0bq3bsnis4oelr25/load-balancer.admin/serviceAccount:aje76ri01fl3cjekutnu]
yandex_vpc_subnet.private-subnet-a: Refreshing state... [id=e9b2es6suisu8ltu93h1]
yandex_vpc_subnet.private-subnet-d: Refreshing state... [id=fl85607db4b5o699f5lj]
yandex_dns_recordset.ai-radio-validation-record: Refreshing state... [id=dnsa3b4e1v1m1t0bts9n/_acme-challenge.ai-radio.ru./TXT]
yandex_dns_recordset.stream-ai-radio-validation-record: Refreshing state... [id=dnsa3b4e1v1m1t0bts9n/_acme-challenge.stream.ai-radio.ru./TXT]
yandex_dns_recordset.ai-radio-a-stream: Refreshing state... [id=dnsa3b4e1v1m1t0bts9n/stream.ai-radio.ru./A]
yandex_container_repository.ai-radio-caster-helm: Refreshing state... [id=crp7qs631dlt4s570k75]
yandex_container_repository.ai-radio-caster: Refreshing state... [id=crpbtgfvmmpdnhdg9t32]
data.yandex_lockbox_secret_version.aws-sa-static-key-version: Reading...
yandex_kubernetes_cluster.k8s-cluster: Refreshing state... [id=cat4c9kn5dutpbre0cvd]
data.yandex_cm_certificate.ai-radio-cert: Reading...
data.yandex_cm_certificate.stream-ai-radio-cert: Reading...
data.yandex_cm_certificate_content.ai-radio-cert-content: Read complete after 1s [id=fpql2nfpt7g9kugod3tp]
yandex_container_repository_iam_binding.ai-radio-caster-helm-puller: Refreshing state... [id=crp7qs631dlt4s570k75/container-registry.images.puller]
yandex_container_repository_lifecycle_policy.ai-radio-caster-helm-policy: Refreshing state... [id=crphj9fu55gj9saj0pbc]
yandex_container_repository_iam_binding.ai-radio-caster-puller: Refreshing state... [id=crpbtgfvmmpdnhdg9t32/container-registry.images.puller]
yandex_container_repository_lifecycle_policy.ai-radio-caster-policy: Refreshing state... [id=crpsooevmf3fknvdn86q]
data.yandex_cm_certificate.ai-radio-cert: Read complete after 0s [id=fpql2nfpt7g9kugod3tp]
data.yandex_cm_certificate.stream-ai-radio-cert: Read complete after 0s [id=fpqkt3jp8mdp76t4la45]
yandex_kubernetes_node_group.worker-nodes-d: Refreshing state... [id=catjfmvepsr6taoniutd]
data.yandex_lockbox_secret_version.aws-sa-static-key-version: Read complete after 1s [id=e6qv91po3p4rku26r9si]
data.yandex_message_queue.ai-radio-voice-gen: Reading...
yandex_storage_bucket.ai-radio-website-bucket: Refreshing state... [id=ai-radio-website]
yandex_message_queue.ai-radio-voice-gen-dlq: Refreshing state... [id=https://message-queue.api.cloud.yandex.net/b1g8qcamg52qan7dcgi5/dj600000002v9dog03ad/ai-radio-voice-gen-dlq.fifo]
yandex_storage_bucket.ai-radio-music-bucket: Refreshing state... [id=ai-radio-music]
yandex_message_queue.ai-radio-voice-gen: Refreshing state... [id=https://message-queue.api.cloud.yandex.net/b1g8qcamg52qan7dcgi5/dj600000002v9don03ad/ai-radio-voice-gen.fifo]
data.yandex_message_queue.ai-radio-voice-gen: Read complete after 1s [id=https://message-queue.api.cloud.yandex.net/b1g8qcamg52qan7dcgi5/dj600000002v9don03ad/ai-radio-voice-gen.fifo]
yandex_api_gateway.static-gateway: Refreshing state... [id=d5dqqp7097jjsptjqir5]
yandex_dns_recordset.ai-radio-aname-root: Refreshing state... [id=dnsa3b4e1v1m1t0bts9n/@/ANAME]
yandex_dns_recordset.ai-radio-aname-www: Refreshing state... [id=dnsa3b4e1v1m1t0bts9n/www.ai-radio.ru./ANAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.yandex_lockbox_secret_version.tts-sa-static-key-version will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_lockbox_secret_version" "tts-sa-static-key-version" {
      + entries    = (known after apply)
      + id         = (known after apply)
      + secret_id  = "e6qgui96khie6kv6cqrb"
      + version_id = "e6qhnms8vk9bhj3spupc"
    }

  # yandex_iam_service_account.func-sa will be created
  + resource "yandex_iam_service_account" "func-sa" {
      + created_at  = (known after apply)
      + description = "serverless function invoker service account for ai-radio.ru"
      + folder_id   = "b1gp0hm2r5phfig97crb"
      + id          = (known after apply)
      + name        = "func-sa"
    }

  # yandex_iam_service_account_api_key.tts-sa-api-key will be updated in-place
  ~ resource "yandex_iam_service_account_api_key" "tts-sa-api-key" {
        id                           = "aje99i2kjdq6rio7d6fr"
      - scope                        = "yc.ai.speechkitTts.execute" -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # yandex_logging_group.speech-generator-log will be created
  + resource "yandex_logging_group" "speech-generator-log" {
      + cloud_id         = (known after apply)
      + created_at       = (known after apply)
      + folder_id        = "b1giva7npaibs6fea9s8"
      + id               = (known after apply)
      + name             = "speech-generator-log"
      + retention_period = (known after apply)
      + status           = (known after apply)
    }

  # yandex_resourcemanager_cloud_iam_member.func-sa-functionInvoker will be created
  + resource "yandex_resourcemanager_cloud_iam_member" "func-sa-functionInvoker" {
      + cloud_id = "b1g8qcamg52qan7dcgi5"
      + id       = (known after apply)
      + member   = (known after apply)
      + role     = "functions.functionInvoker"
    }

  # yandex_resourcemanager_cloud_iam_member.func-sa-lockbox-payloadViewer will be created
  + resource "yandex_resourcemanager_cloud_iam_member" "func-sa-lockbox-payloadViewer" {
      + cloud_id = "b1g8qcamg52qan7dcgi5"
      + id       = (known after apply)
      + member   = (known after apply)
      + role     = "lockbox.payloadViewer"
    }

  # yandex_resourcemanager_folder.functions will be created
  + resource "yandex_resourcemanager_folder" "functions" {
      + cloud_id   = "b1g8qcamg52qan7dcgi5"
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "functions"
    }

  # yandex_storage_bucket.ai-radio-functions-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-functions-bucket" {
      + access_key            = (sensitive value)
      + bucket                = "ai-radio-functions"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = "b1ga4mk6ef2hkmpaibvd"
      + force_destroy         = false
      + id                    = (known after apply)
      + max_size              = 10737418240
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ tts_key                  = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @valeter, Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR checks`*